## Data Exploration using Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv', sep = '|')

#### Adding, Subtracting, Concatenating columns

In [3]:
df['Age']+df['Fare']

0       29.2500
1      109.2833
2       33.9250
3       88.1000
4       43.0500
         ...
886     40.0000
887     49.0000
888         NaN
889     56.0000
890     39.7500
Length: 891, dtype: float64

In [44]:
# Arithmatic operations directly on columns

df['Age']*2

0      44.0
1      76.0
2      52.0
3      70.0
4      70.0
       ...
886    54.0
887    38.0
888     NaN
889    52.0
890    64.0
Name: Age, Length: 891, dtype: float64

In [4]:
# Concatenating String Columns

df['Name'] + ', ' + df['Sex']

0                          Braund, Mr. Owen Harris, male
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                         Heikkinen, Miss. Laina, female
3      Futrelle, Mrs. Jacques Heath (Lily May Peel), ...
4                         Allen, Mr. William Henry, male
                             ...
886                          Montvila, Rev. Juozas, male
887                 Graham, Miss. Margaret Edith, female
888     Johnston, Miss. Catherine Helen "Carrie", female
889                          Behr, Mr. Karl Howell, male
890                            Dooley, Mr. Patrick, male
Length: 891, dtype: object

#### Checking for Missing Values and dropping/replacing missing values

In [69]:
# How to check for missing values in columns

df.isnull().sum() #df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [70]:
# check which values are not missing
df.notnull().sum()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [71]:
# How to drop rows having missing value

df.dropna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [72]:
# df.dropna(how = 'all')

In [73]:
# How to ignore missing values from specific column/s

df.dropna(subset = ['Age'], )

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [74]:
# df.dropna(subset = ['Age','Cabin'], how = 'all')

In [75]:
# How to ignore missing values from specific column

df[~df.Age.isnull()].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [76]:
# How to replace missing values

df.Age.fillna(df['Age'].mean(),)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

#### How to remove duplicate rows

In [ ]:
df.drop_duplicates()

In [ ]:
df.drop_duplicates(subset =)

#### Aggregating data using crosstab, groupby and pivot_table

**pd.crosstab()** - Compute a simple cross tabulation of two (or more) categorical variables. By default computes a frequency table of the categorical variables unless an array of values and an aggregation function are passed.

In [77]:
# How many passenger survived were male or female

In [78]:
pd.crosstab(df['Survived'],df['Sex'])
#pd.crosstab(df['Survived'],df['Sex'], normalize = True, margins = True)

Sex       female  male
Survived
0             81   468
1            233   109

In [79]:
pd.crosstab(df['Survived'],df['Sex'], normalize = 'index', margins = True)

Sex         female      male
Survived
0         0.147541  0.852459
1         0.681287  0.318713
All       0.352413  0.647587

In [80]:
pd.crosstab(df['Survived'],df['Sex'], normalize = 'columns', margins = True)

Sex         female      male       All
Survived
0         0.257962  0.811092  0.616162
1         0.742038  0.188908  0.383838

In [81]:
#pd.crosstab(df['Survived'],df['Sex'],values = df['Age'],aggfunc = 'mean')

A **groupby** operation involves some combination of splitting the object, applying a function, and combining the results. This can be used to group large amounts of data and compute operations on these groups.

In [82]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [83]:
# What is the average age of the passengers who survived and who did not

In [84]:
#df.groupby('Survived')['Age'].agg(['count','min','max','mean','median'])

In [85]:
# What is the average age and Fare of the passengers who survived and who did not

#df.groupby('Survived')[['Age','Fare']].mean()

In [86]:
#df.groupby('Survived').mean()

In [87]:
# What is the average age and median of Fare of the passengers who survived and who did not

#df.groupby('Survived').agg({'Age':'mean','Fare':'median'})

In [88]:
df.groupby('Survived').agg({'Age':'mean','Fare':'median','Pclass':'unique'})

                Age  Fare     Pclass
Survived
0         30.626179  10.5  [3, 1, 2]
1         28.343690  26.0  [1, 3, 2]

In [89]:
# How many passenger survived were male or female

df.groupby(['Survived','Sex']).size()

Survived  Sex
0         female     81
          male      468
1         female    233
          male      109
dtype: int64

In [90]:
# What is the average age of passengers gender wise who survived and who did not

df.groupby(['Survived','Sex'])['Age'].mean()

Survived  Sex
0         female    25.046875
          male      31.618056
1         female    28.847716
          male      27.276022
Name: Age, dtype: float64

In [91]:
df.groupby(['Survived','Sex'])['Age'].mean().unstack()

Sex          female       male
Survived
0         25.046875  31.618056
1         28.847716  27.276022

In [92]:
df.groupby(['Survived','Sex'])['Age'].mean().reset_index()

   Survived     Sex        Age
0         0  female  25.046875
1         0    male  31.618056
2         1  female  28.847716
3         1    male  27.276022

In [93]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [94]:
# Exercise Question

#People boarded from which port survived the most

In [107]:
#How many people survived if Fare is less than 20

#### Pivot Table

In [108]:
# What is the average age of passengers who survived and who did not

df.pivot_table(index='Survived', values = 'Age', aggfunc = 'mean')

                Age
Survived
0         30.626179
1         28.343690

In [112]:
# How many passenger survived were male or female

df.pivot_table(index='Survived', values = 'Sex', aggfunc = 'count')

          Sex
Survived
0         549
1         342

In [113]:
# What is the average age of passengers gender wise who survived and who did not

df.pivot_table(index='Survived', columns = 'Sex', values = 'Age', aggfunc = 'mean')

Sex          female       male
Survived
0         25.046875  31.618056
1         28.847716  27.276022

#### Reshaping dataframe using melt

In [214]:
df2 = df.pivot_table(index='Survived', columns = 'Sex', values = 'Age', aggfunc = 'mean').reset_index()
df2

Sex  Survived     female       male
0           0  25.046875  31.618056
1           1  28.847716  27.276022

In [207]:
df2.melt( ,value_name  = 'Mean_Age')

      Sex   Mean_Age
0  female  25.046875
1  female  28.847716
2    male  31.618056
3    male  27.276022

### Merge/Joins

There are actually four types of joins supported by the Pandas `merge` function. Here's how they are described by the documentation:

- **inner:** use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys
- **outer:** use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically
- **left:** use only keys from left frame, similar to a SQL left outer join; preserve key order
- **right:** use only keys from right frame, similar to a SQL right outer join; preserve key order

The default is the "inner join", which was used when creating the movie_ratings DataFrame.

It's easiest to understand the different types by looking at some simple examples:

#### Example DataFrames A and B

In [66]:
A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1, 2, 3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [67]:
B = pd.DataFrame({'color': ['green', 'yellow', 'pink'], 'size':['S', 'M', 'L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

#### Inner join

Only include observations found in both A and B:

In [68]:
pd.merge(A, B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

#### Outer join

Include observations found in either A or B:

In [69]:
pd.merge(A, B, how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

#### Left join

Include all observations found in A:

In [70]:
pd.merge(A, B, how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

#### Right join

Include all observations found in B:

In [71]:
pd.merge(A, B, how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L

#### Concating Dataframes

In [75]:
pd.concat()

    color  num   color  num
0   green    1   green    1
1  yellow    2  yellow    2
2     red    3     red    3

In [77]:
pd.concat([A,B], axis = 1)

    color  num   color size
0   green    1   green    S
1  yellow    2  yellow    M
2     red    3    pink    L

In [96]:
#pd.concat([A,A,A])

### Transforming Columns using map, apply and applymap

In [7]:
# Transforming a column/Series using map
# Map male to 0 and female to 1 in Sex column

df['Sex_num'] = df['Sex'].map({'male':0,'female':1})

In [11]:
df.head(3)
#df.loc[0:4:,['Sex','Sex_num']]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_num
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1

In [20]:
# Create a new column which contains number of characters in the name

# How to find length of string
#df['Name_length'] = df['Name'].apply(len)
#df['Name'].map(len)

In [21]:
df.loc[0:4, ['Name','Name_length']]

                                                Name  Name_length
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           44
4                           Allen, Mr. William Henry           24

In [31]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_num,Name_length
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,23
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,51
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,22

In [52]:
def addition(a):
    return a+4

In [53]:
df['Age'].apply(addition)

0      26.0
1      42.0
2      30.0
3      39.0
4      39.0
       ...
886    31.0
887    23.0
888     NaN
889    30.0
890    36.0
Name: Age, Length: 891, dtype: float64

### Lambda Functions

In Python, we use the lambda keyword to declare an anonymous function, which is why we refer to them as "lambda functions". A lambda function can take any number of arguments, but they contain only a single expression. An expression is a piece of code executed by the lambda function, which may or may not return any value.

In [56]:
add = lambda x: x+2

In [57]:
add(2)

4

In [58]:
df['Age'].apply(lambda x: x+2)

0      24.0
1      40.0
2      28.0
3      37.0
4      37.0
       ...
886    29.0
887    21.0
888     NaN
889    28.0
890    34.0
Name: Age, Length: 891, dtype: float64

In [64]:
# Apply functions can work on multiple columns also

df[['Age','Fare']].apply(lambda x: x+2)

#df[['Age','Fare']] = df[['Age','Fare']].apply(lambda x: x+2)

      Age     Fare
0    24.0   9.2500
1    40.0  73.2833
2    28.0   9.9250
3    37.0  55.1000
4    37.0  10.0500
..    ...      ...
886  29.0  15.0000
887  21.0  32.0000
888   NaN  25.4500
889  28.0  32.0000
890  34.0   9.7500

[891 rows x 2 columns]

In [94]:
# logarithmic transformation of multiple columns

df[['Age','Fare']].apply(np.log)

          Age      Fare
0    3.091042  1.981001
1    3.637586  4.266662
2    3.258097  2.070022
3    3.555348  3.972177
4    3.555348  2.085672
..        ...       ...
886  3.295837  2.564949
887  2.944439  3.401197
888       NaN  3.154870
889  3.258097  3.401197
890  3.465736  2.047693

[891 rows x 2 columns]

In [92]:
df[['Age','Fare']].apply(max) # ,axis =1)

Age      80.0000
Fare    512.3292
dtype: float64

In [107]:
#df[['Age','Fare']].apply(lambda x: x.idxmax(), axis = 1)

0       Age
1      Fare
2       Age
3      Fare
4       Age
       ...
886     Age
887    Fare
888    Fare
889    Fare
890     Age
Length: 891, dtype: object

#### applymap

The applymap() function is used to apply a function to a Dataframe elementwise. This method applies a function that accepts and returns a scalar to every element of a DataFrame

In [111]:
df[['Age','Fare']].applymap(lambda x : x**2)

        Age         Fare
0     484.0    52.562500
1    1444.0  5081.308859
2     676.0    62.805625
3    1225.0  2819.610000
4    1225.0    64.802500
..      ...          ...
886   729.0   169.000000
887   361.0   900.000000
888     NaN   549.902500
889   676.0   900.000000
890  1024.0    60.062500

[891 rows x 2 columns]

In [109]:
#df[['Age','Fare']].applymap(max)

In [1]:
#To compare two columns via logical operation

In [ ]:
np.where()

#### Working with Date and time

In [139]:
ts = pd.read_csv('timeSeries.csv')

In [140]:
ts.head(3)

         date  Sales
0  2018-01-01    115
1  2018-01-02    126
2  2018-01-03    166

In [141]:
ts['date'] = pd.to_datetime(ts['date'])

In [205]:
ts.dtypes

date     datetime64[ns]
Sales             int64
year              int64
month             int64
dtype: object

In [198]:
ts.date.dt.year
#ts.date.dt.month
#ts.date.dt.date
#ts.date.dt.hour
#ts.date.dt.month_name()

0      0
1      0
2      0
3      0
4      0
      ..
725    0
726    0
727    0
728    0
729    0
Name: date, Length: 730, dtype: int64

In [148]:
# Exercise - Calculate monthly sales and find the month for which it is maximum in each year

In [184]:
# ts['year'] = ts['date'].dt.year
# ts['month'] = ts['date'].dt.month

# temp = ts.groupby(['year','month'])['Sales'].sum().reset_index()
# temp.sort_values(by = ['year','Sales'], ascending = [True, False]).drop_duplicates(subset = 'year')
# temp.loc[temp.groupby('year')['Sales'].idxmax()]

#### Exporting Output

In [150]:
#Writing to a csv file

df.to_csv('output.csv')

In [ ]:
# Saving the file without the index values

df.to_csv('output.csv', index = False)

In [ ]:
# Saving file with specific columns and deimiter other than ,
    
df.to_csv('output.csv', index = False, columns = ['PassengerId','Survived'], sep = '|')

#### Reading and writing from/to excel files

In [155]:
data = pd.read_excel('order_data.xlsx') # By default it reads the first sheet

In [153]:
data.head(3)

,customer_id,first_name,last_name,email,address,city,state,zipcode
0,1,George,Washington,gwashington@usa.gov,3200 Mt Vernon Hwy,Mount Vernon,VA,22121
1,2,John,Adams,jadams@usa.gov,1250 Hancock St,Quincy,MA,2169
2,3,Thomas,Jefferson,tjefferson@usa.gov,931 Thomas Jefferson Pkwy,Charlottesville,VA,22902

In [162]:
# To read ant sheet number

data = pd.read_excel('order_data.xlsx', sheet_name = 1)
#data = pd.read_excel('order_data.xlsx', sheet_name = 'order')
data.head(3)

   order_id  order_date  amount  customer_id
0         1  07/04/1776  234.56            1
1         2  03/14/1760   78.50            3
2         3  05/23/1784  124.00            2

In [170]:
#To read multiple sheets

data = pd.read_excel('order_data.xlsx', sheet_name = [0,1]) # returns a dictionary of dataframes
#data = pd.read_excel('order_data.xlsx', sheet_name = ['customer', 'order'])

In [171]:
data.keys()

dict_keys([0, 1])

In [173]:
#data[0]
#data[1]

In [ ]:
#data['customer']
#data['order']

In [174]:
# To read all the sheet in excel file

data = pd.read_excel('order_data.xlsx', sheet_name = None)

In [225]:
#Writing to an excel file

writer = pd.ExcelWriter('myOutput.xlsx')

In [226]:
data['customer'].to_excel(writer, sheet_name = 'customer', index = False)

In [ ]:
data['order'].to_excel(writer, sheet_name = 'order',index = False)

In [227]:
writer.save()

### Resources

* https://www.dataschool.io/easier-data-analysis-with-pandas/
* https://github.com/justmarkham/pandas-videos/blob/master/pandas.ipynb (Github repository of above video series)
* https://www.dataschool.io/best-practices-with-pandas/
* https://www.dataschool.io/best-python-pandas-resources/
* https://www.datacamp.com/community/blog/python-pandas-cheat-sheet